target/test-classes/xml/ocs/TC4997_Create_Subscriber_Request_Msg.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://www.huawei.com/bme/cbsinterface/bcservices" xmlns:ns3="http://www.huawei.com/bme/cbsinterface/bccommon" xmlns:ns4="http://www.huawei.com/bme/cbsinterface/cbscommon">
        <ns2:CreateSubscriberRequestMsg xmlns:ns2="http://www.huawei.com/bme/cbsinterface/bcservices">
            <RequestHeader>
                <ns4:Version>1</ns4:Version>
                <ns4:MessageSeq>1</ns4:MessageSeq>
                <ns4:OwnershipInfo>
                    <ns4:BEID>1031</ns4:BEID>
                </ns4:OwnershipInfo>
                <ns4:AccessSecurity>
                    <ns4:LoginSystemCode>123</ns4:LoginSystemCode>
                    <ns4:Password>password</ns4:Password>
                </ns4:AccessSecurity>
            </RequestHeader>
            <CreateSubscriberRequest>
                <ns2:RegisterCustomer OpType="2">
                    <ns2:CustKey>TMPAYM$custKey$C</ns2:CustKey>
                </ns2:RegisterCustomer>
                <ns2:Account>
                    <ns2:AcctKey>TMPAYM$acctKey1$A</ns2:AcctKey>
                    <ns2:AcctInfo>
                        <ns3:BillCycleType>02</ns3:BillCycleType>
                        <ns3:PaymentType>1</ns3:PaymentType>
                        <ns3:CreditLimit>
                            <ns3:LimitType>C_INITIAL_CREDIT_LIMIT</ns3:LimitType>
                            <ns3:LimitValue>0</ns3:LimitValue>
                        </ns3:CreditLimit>
                    </ns2:AcctInfo>
                </ns2:Account>
                <ns2:Subscriber>
                    <ns2:SubscriberKey>TMPAYM$acctKey1$S</ns2:SubscriberKey>
                    <ns2:SubscriberInfo>
                        <ns3:UserCustomerKey>TMPAYM$custKey$C</ns3:UserCustomerKey>
                        <ns3:SubIdentity>
                            <ns3:SubIdentityType>1</ns3:SubIdentityType>
                            <ns3:SubIdentity>447985028070</ns3:SubIdentity>
                            <ns3:PrimaryFlag>1</ns3:PrimaryFlag>
                        </ns3:SubIdentity>
                        <ns3:ConsumptionLimit>
                            <ns3:LimitType>SAFETY_BUFFER</ns3:LimitType>
                            <ns3:UnitType>M</ns3:UnitType>
                            <ns3:CurrencyID>1052</ns3:CurrencyID>
                            <ns3:LimitValue>200000</ns3:LimitValue>
                        </ns3:ConsumptionLimit>
                    </ns2:SubscriberInfo>
                    <ns2:SubPaymentMode>
                        <ns2:PaymentMode>1</ns2:PaymentMode>
                        <ns2:PayRelationKey>TMPAYM$acctKey1$P</ns2:PayRelationKey>
                        <ns2:AcctKey>TMPAYM$acctKey1$A</ns2:AcctKey>
                    </ns2:SubPaymentMode>
                </ns2:Subscriber>
                <ns2:PrimaryOffering>
                    <ns3:OfferingKey>
                        <ns3:OfferingCode>C_Safety_Buffer_Tariff</ns3:OfferingCode>
                    </ns3:OfferingKey>
                    <ns3:OfferingInstProperty>
                        <ns3:PropCode>C_LEGACY_OFFERCODE</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>FF24-0750-250-5M4M</ns3:Value>
                    </ns3:OfferingInstProperty>
                    <ns2:EffectiveTime>$effectiveTime$000000</ns2:EffectiveTime>
                </ns2:PrimaryOffering>
                <ns2:SupplementaryOffering>
                    <ns3:OfferingKey>
                        <ns3:OfferingCode>C_Core_Data</ns3:OfferingCode>
                        <ns3:PurchaseSeq>67864366</ns3:PurchaseSeq>
                    </ns3:OfferingKey>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_DIY_DATA_AMOUNT</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>512000</ns3:Value>
                    </ns3:OInstProperty>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_LEGACY_OFFERCODE</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>500MB-DATA-500-FC</ns3:Value>
                    </ns3:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns3:Mode>I</ns3:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
                <ns2:SupplementaryOffering>
                    <ns3:OfferingKey>
                        <ns3:OfferingCode>C_Core_Minutes_PAYM</ns3:OfferingCode>
                        <ns3:PurchaseSeq>$acctKey1$</ns3:PurchaseSeq>
                    </ns3:OfferingKey>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_DIY_VOICE_AMOUNT</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>15000</ns3:Value>
                    </ns3:OInstProperty>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_LEGACY_OFFERCODE</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>FC250</ns3:Value>
                    </ns3:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns3:Mode>I</ns3:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
                <ns2:SupplementaryOffering>
                    <ns3:OfferingKey>
                        <ns3:OfferingCode>C_Core_SMS</ns3:OfferingCode>
                        <ns3:PurchaseSeq>$acctKey1$</ns3:PurchaseSeq>
                    </ns3:OfferingKey>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_DIY_SMS_AMOUNT</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>5000</ns3:Value>
                    </ns3:OInstProperty>
                    <ns3:OInstProperty>
                        <ns3:PropCode>C_LEGACY_OFFERCODE</ns3:PropCode>
                        <ns3:PropType>1</ns3:PropType>
                        <ns3:Value>FC250</ns3:Value>
                    </ns3:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns3:Mode>I</ns3:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
            </CreateSubscriberRequest>
        </ns2:CreateSubscriberRequestMsg>
    </S:Body>
</S:Envelope>